{
    "categories": [
        [
        ]
    ],
    "company": {
        "id": 11913,
        "name": "Siemens",
        "short_name": "siemens"
    },
    "contents": "<p>For our Digital Industries, we are looking for Energy Efficiency Specialist<br><br><strong>What do I need to qualify for this job?</strong><br><br>•   5+ years of work experience in Cable or Wood industry (3+ years in field engineering or maintenance/energy management roles)<br><br>•   University degree in Electrical / Electrical&amp;Electronics Engineering<br><br>•   Very good command of English<br><br>•   Engineering experience on management and/or commissioning of energy efficiency projects in industrial technologies <br><br>•   Experience in project implementation about energy efficiency and project&amp;team management methodologies<br><br>•   Excellent analytical capabilities and experience with energy and sustainability <br><br>•   Must have experience about energy management in an industrial plant,<br><br>•   Must have specific trainings or certifications about energy efficiency services (e.g. Energy Manager Certificate, CMVP, Certified Industrial Energy Auditor etc.)<br><br><ul><li>Excellent technical reporting experience/ability,</li><li>Knowledge in process engineering and process optimization for energy efficiency,</li></ul><br><strong>What are my responsibilities?</strong><br><br><ul><li>As part of a Customer Services team, you will work productively with other Consultants, Engineering Experts and Project Managers, and other internal &amp; external interfaces,</li><li>Responsible for the delivery of individual energy efficiency project consulting and technical expertise in Siemens energy efficiency consultant portfolio, for the Siemens DI CS to be delivered successfully and provide value to the customer,</li><li>Perform and manage energy efficiency retrofit projects with intensive experience in automation and drive systems and process engineering,</li><li>Managing complex energy efficiency projects including field engineers team management and subcontractor management,</li><li>Identification and analysis of local ESCO market trends, EnPC models and retrofit solutions,</li><li>Have experience in Utilities Management and ISO 50001 Energy Management System in industrial facilities,</li><li>Engage with customers and prospects to gather high level customer business and technical requirements, understand existing information, determine customer needs as part of the service delivery and take necessary actions to create appropriate solutions,</li></ul><br><strong>What else do I need to know?</strong><br><br>•   No travel restrictions, Able to adapt to flexible working hours and travels,<br><br>•   Type - B driver's license, able to drive actively<br><br>\"At Siemens we are always challenging ourselves to build a better future. We need the most innovative and diverse Digital Minds to develop tomorrow's reality. Find out more about the Digital world of Siemens here: www.siemens.com/careers/digitalminds\"<br><br>As Siemens we believe physical barriers are not related to potential. Only the potential matters to us. Therefore, we look forward to receive applications of candidates with physical barriers and chronic illnesses. We support healthy relationships between candidates with barriers and their colleagues because we believe we can create differences together.<br><br>Siemens is dedicated to quality, equality, and valuating diversity and we welcome applications that reflect the diversity of the communities within which we work.<br><br>We are looking forward to receiving your online application. Please ensure you complete all areas of the application form to the best of you ability as we will use the data to review your suitability to the role.<br><br>Please find more information from our web site:<br><br>https://new.siemens.com/tr/tr.html<br><br>Contact<br><br>If you need more information please don't hesitate to contact us.<br><br>+90 216 459 20 00<br><br>https://new.siemens.com/tr/tr/genel/iletisim.html<br><br>callcenter.tr@siemens.com<br><br>www.instagram.com/siemensturkiye<br><br>https://m.youtube.com/user/Siemens<br><br>http://www.twitter.com/siemensturkiye<br><br>http://www.facebook.com/siemensturkiye<br><br><b>Organization:</b> Digital Industries<br><br><b>Company:</b> Siemens Sanayi ve Ticaret Anonim Sirketi<br><br><b>Experience Level:</b> Mid-level Professional<br><br><b>Full / Part time:</b> Full-time</p>",
    "id": 9656529,
    "levels": [
        [
        ]
    ],
    "locations": [
        [
        ]
    ],
    "model_type": "jobs",
    "name": "Energy Efficiency Specialist",
    "publication_date": "2022-08-22T23:50:16Z",
    "refs": {
        "landing_page": "https://www.themuse.com/jobs/siemens/energy-efficiency-specialist-d7ee66"
    },
    "short_name": "energy-efficiency-specialist-d7ee66",
    "tags": [],
    "type": "external"
}